# **Tarea Nº 4**

- Fecha y hora de entrega: Domingo 12 de enero, 11:59pm
- Agregue los nombres de las personas con las que discutió esta tarea: __Leydi Chipana__
- Envíe su tarea haciendo el `push` de su código a su repo en GitHub Classroom:

## **Mercado de autos usados**

Importa el conjunto de datos `neoauto_20240924.csv`

1. ¿Cuál es el precio promedio de los autos de cada marca (`item_brand`) publicados en cada subcategoría (`item_category_2`)?

In [5]:
# Solución

import pandas as pd
df1 = pd.read_csv('neoauto_20240924.csv')
# Agrupamos las columnas 'item_brand' y 'item_category_2' en la nueva data average_price
# Calculamos la medfia de item_price con .mean()
average_price = df1.groupby( ['item_brand' , 'item_category_2' ])[['item_price']].mean()
average_price
# El precio promedio por marca y subcategoría se muestra en item_price

                                 item_price
item_brand   item_category_2
ALFA-ROMEO   Hatchback          8500.000000
             Sedan              2500.000000
ASTON MARTIN Camionetas Suv   229000.000000
             Deportivo        169990.000000
             Sedan            149900.000000
...                                     ...
VOLVO        Camionetas Suv    41801.707317
             Deportivo          8800.000000
             Hatchback         12772.500000
             Sedan             11458.333333
             Station Wagon      6100.000000

[202 rows x 1 columns]

2. ¿Cuántos autos tienen más de 100,000 kilómetros (`item_km`) pero un precio (`item_price`) menor al promedio general?

In [6]:
# Solución
mean_price = df1['item_price'].mean()
# Usamos el operador & para unir 2 filtrados
df_km_price = df1[(df1['item_km'] > 100000) & (df1['item_price'] < mean_price)]
# Shape nos da el número de filas o elementos
print("\nNúmero de autos con más de 100,000 km y precio menor al promedio general:", df_km_price.shape[0])

Número de autos con más de 100,000 km y precio menor al promedio general: 497

3. Encuentra el modelo (`item_name`) más caro y el más barato de cada marca (`item_brand`).

In [11]:
# Solución
# Usaremos los métodos idxmax y idxmin para encontrar el indice de filas que requerimos
max_price = df1.loc[df1.groupby('item_brand')['item_price'].idxmax()][['item_brand', 'item_name', 'item_price']]
min_price = df1.loc[df1.groupby('item_brand')['item_price'].idxmin()][['item_brand', 'item_name', 'item_price']]
min_price.head()
max_price.head()

        item_brand                item_name  item_price
1362    ALFA-ROMEO      alfa-romeo 147 2006      8500.0
1313  ASTON MARTIN    aston martin dbx 2021    229000.0
1208          AUDI           audi rs 6 2024    220000.0
3708        AUSTIN  austin mini cooper 1970         1.0
2317          BAIC            baic x55 2021     12800.0

4. Encuentra las tres marcas con mayor número de autos financiados por Santander (`item_financed_by`).

In [12]:
# Solución
santander_financed = df1[df1['item_financed_by'] == 'Santander']
# Usamos value_counts() para las marcas por autos Santader
# Luego usamos head(3) para quedarnos con los 3 más altos
# Terminamos con reset_index() para convertir en un dataframe
financed_brands = santander_financed['item_brand'].value_counts().head(3).reset_index()
financed_brands.columns = ['item_brand', 'count'] #filtramos las dos columnas 
financed_brands
# Las 3 marcas con mayor financiamientpo por Santander son BMW, TOYOTA y NISSAN

  item_brand  count
0        BMW    296
1     TOYOTA    261
2     NISSAN    228

5. Agrupa las publicaciones por tipo de transmisión (`item_transmission`) y calcula la desviación estándar del precio (`item_price`) para cada tipo.

In [89]:
# Solución
transmission_std = df1.groupby('item_transmission')['item_price'].std().reset_index()
transmission_std

         item_transmission    item_price
0               Automática  15332.729048
1  Automática - Secuencial  22678.641589
2                 Mecánica   8137.122127

6. ¿Cuál es el kilometraje promedio de las publicaciones con el tag "Premium" y de las publicaciones con el tag "Como nuevo"?

In [69]:
# Solución
# Usamos str.contains para filtar el texto
# También nos aseguramos que los valores faltantes no generen conflictos
tag_premium = df1[df1['item_tag'].str.contains('Premium', na=False)]['item_km'].mean()
tag_como_nuevo = df1[df1['item_tag'].str.contains('Como nuevo', na=False)]['item_km'].mean()
print('Kilometraje promedio de publicaciones con el tag "Premium":' , tag_premium,
      '\nKilometraje promedio de publicaciones con el tag "Como nuevo":' , tag_como_nuevo)

Kilometraje promedio de publicaciones con el tag "Premium": 48400.235897435894
Kilometraje promedio de publicaciones con el tag "Como nuevo": 35963.47619047619

7. ¿Cuáles son las marcas de vehículas para los que todos sus modelos fabricados en los últimos 5 años tienen al menos 5 publicaciones cada una?

In [16]:
# Solución

# Ordenamos los años con sorted y obtenemos solo valores únicos con unique()
# Seleccionamos los 5 últimos años -> [-5:]
last_5_years = sorted(df1['item_year'].unique())[-5:]
# Los últimos 5 años fueron 2021 - 2025

# Filtamos las publicaciones de esos años con .isin
df_last_5y = df1[df1['item_year'].isin(last_5_years)]

# Contamos con size() las filas agrupadas por marca y modelo y convertimos en dataframe
count = df_last_5y.groupby(['item_brand', 'item_name']).size().reset_index(name='count')

# Filtramos las publicaciones con al menos 5 
df_last_5y_filt= count[count['count'] >= 5]

#lista
list_models = df_last_5y_filt.groupby(
    'item_brand').filter(lambda x: x['count'].count() == len(last_5_years))['item_brand'].unique()
print("\nMarcas con todos los modelos fabricados en los últimos 5 años con al menos 5 publicaciones:\n", list_models)
s

TypeError: 'int' object is not callable

## **Evolución económica internacional**

Importa el conjunto de datos de la hoja "Data" del archivo `pwt1001.xlsx`. El diccionario de variables está disponible en la hoja "Legend" del archivo Excel.

1. Calcule el PBI per cápita real ajustado por poder de paridad de compra (PPP). Use la variable de PBI que se calcula por gasto y la población. ¿Cuáles son los 10 países top?

In [109]:
# Solución
import pandas as pd
import numpy as np

# Importar los datos
data = pd.read_excel('pwt1001.xlsx', sheet_name='Data')
legend = pd.read_excel('pwt1001.xlsx', sheet_name='Legend')
# Usamos Expenditure-side real GDP at chained PPPs (in mil. 2017US$)
top_10_countries = data.groupby('country')['rgdpe'].max().sort_values(ascending=False).head(10)
top_10_countries

country
United States         20860506.00
China                 20056066.00
India                  8945547.00
Japan                  5108800.00
Germany                4308861.50
Russian Federation     4234081.50
Brazil                 3294728.50
United Kingdom         3118991.25
Indonesia              3104438.75
France                 3018884.75
Name: rgdpe, dtype: float64

2. Genera el ránking de los países con el mayor incremento del PBI per cápita real PPP entre los años 1990 y 2019. ¿Dónde se ubica Perú? Para los países que no tengan información para dichos años, puede utilizar datos provenientes de hasta dos años antes o después

In [117]:
# Solución
data_filt = data[(data['year'] >= 1988) & (data['year'] <= 2019)]
data_1990 = data_filt[(data_filt['year'] >= 1988) & (data_filt[
    'year'] <= 1992)].groupby('country')['rgdpe'].mean()
data_2019 = data_filt[(data_filt['year'] >= 2017) & (data_filt[
    'year'] <= 2019)].groupby('country')['rgdpe'].mean()
gdp_change = ((data_2019 - data_1990) / data_1990).dropna().sort_values(ascending=False)
gdp_change.head(10)

peru_rank = gdp_change.reset_index().query("country == 'Peru'").index[0] + 1
peru_rank

np.int64(47)

3. Para el periodo 2010-2019, calcule el promedio del índice del capital humano. ¿Qué relación existe entre esta variable y el PBI per cápita real PPP calculado previamente? ¿y el número de horas laboradas al año por los trabajadores?

In [119]:
# Solución
data_2010_2019 = data[(data['year'] >= 2010) & (data['year'] <= 2019)]
hc_avg = data_2010_2019.groupby('country')['hc'].mean()
pib_avg = data_2010_2019.groupby('country')['rgdpe'].mean()
avh_avg = data_2010_2019.groupby('country')['avh'].mean()

correlation_hc_pib = hc_avg.corr(pib_avg)
correlation_hc_avh = hc_avg.corr(avh_avg)
correlation_hc_avh

np.float64(-0.5769800008938786)

4. A partir de la variable del precio de los hogares, calcula los países y los años en los cuales se registró la mayor inflación anual para todo el periodo de tiempo disponible en la base de datos

In [128]:
# Solución
data = data.sort_values(['country', 'year'])
data['inflation'] = data.groupby('country')['pl_c'].pct_change() * 100
max_inflation = data.groupby('country')['inflation'].max().sort_values(ascending=False).head(10)
max_inflation.head(10)

C:\Users\user\AppData\Local\Temp\ipykernel_8216\3170689994.py:3: FutureWarning: The default fill_method='ffill' in SeriesGroupBy.pct_change is deprecated and will be removed in a future version. Either fill in any non-leading NA values prior to calling pct_change or specify 'fill_method=None' to not fill NA values.
  data['inflation'] = data.groupby('country')['pl_c'].pct_change() * 100

country
Venezuela (Bolivarian Republic of)    355.748049
Zimbabwe                              281.705724
Equatorial Guinea                     278.866183
Brunei Darussalam                     265.190719
Mauritania                            235.565319
Seychelles                            226.327482
Saudi Arabia                          147.961250
Angola                                144.032916
United Arab Emirates                  140.988488
Lebanon                               121.297922
Name: inflation, dtype: float64

5. ¿Cuáles son los países con la mayor cantidad de missing values en la variable de productividad total de factores a precios corrientes?

In [130]:
# Solución
tfp_missing = data['ctfp'].isnull().groupby(data['country']).sum().sort_values(ascending=False)
tfp_missing.head()

country
Albania                      70
Turkmenistan                 70
Sint Maarten (Dutch part)    70
Grenada                      70
Ghana                        70
Name: ctfp, dtype: int64

6.  Agrupa los datos por país y calcula el promedio de las horas trabajadas anuales (avh) y de la educación promedio (hc) para el periodo 2000-2020.

In [131]:
# Solución
data_2000_2020 = data[(data['year'] >= 2000) & (data['year'] <= 2020)]
avh_hc_avg = data_2000_2020.groupby('country')[['avh', 'hc']].mean()
avh_hc_avg

                                            avh        hc
country
Albania                                     NaN  2.895579
Algeria                                     NaN  2.080837
Angola                                      NaN  1.399746
Anguilla                                    NaN       NaN
Antigua and Barbuda                         NaN       NaN
...                                         ...       ...
Venezuela (Bolivarian Republic of)  1874.516018  2.538335
Viet Nam                            2243.230824  2.407059
Yemen                                       NaN  1.444725
Zambia                                      NaN  2.304970
Zimbabwe                                    NaN  2.388763

[183 rows x 2 columns]

7.  Genere una variable que ordene a los países según el porcetaje de formación brutal de capital del 2019. Luego, estable diez grupos a manera de deciles. ¿En qué decil se ubica Péru? Vuelva a calcular usando la información de 1990. ¿El Perú se mantiene en el mismo décil o cambia?

In [133]:
# Solución
data_2019 = data[data['year'] == 2019].copy()
data_1990 = data[data['year'] == 1990].copy()

data_2019['capital_formation_rank'] = pd.qcut(data_2019['csh_i'], 10, labels=False) + 1
data_1990['capital_formation_rank'] = pd.qcut(data_1990['csh_i'], 10, labels=False) + 1

peru_decile_2019 = data_2019.query("country == 'Peru'")['capital_formation_rank'].values[0]
peru_decile_1990 = data_1990.query("country == 'Peru'")['capital_formation_rank'].values[0]

print(f"\nDecil de Perú en 2019: {peru_decile_2019}, en 1990: {peru_decile_1990}")

Decil de Perú en 2019: 5, en 1990: 4.0

## **Transacciones Financieras**

Importa el conjunto de datos `base_financiera.csv`

8. Filtra todas las transacciones de tipo "Debit" en las que el monto sea mayor a 200, y calcula el monto total de esas transacciones. Además, determina cuántos clientes únicos realizaron esas transacciones.

In [136]:
# Solución
data3 = pd.read_csv('base_financiera.csv')

filtered_debit = data3[(data3['Transaction_Type'] == 'Debit') & (data3['Amount'] > 200)]
total_amount_debit = filtered_debit['Amount'].sum()
unique_customers_debit = filtered_debit['Customer_ID'].nunique()
print("Monto total de transacciones tipo 'Debit' mayores a 200:", total_amount_debit)
data3

Monto total de transacciones tipo 'Debit' mayores a 200: 2847871.75

      Transaction_ID Customer_ID        Date   Amount Transaction_Type Region
0               1001        C190  2023-01-01   798.68           Credit  North
1               1002        C016  2023-01-02   906.97            Debit  South
2               1003        C033  2023-01-03  1579.96            Debit  South
3               1004        C142  2023-01-04  1579.62           Credit   East
4               1005        C035  2023-01-05  3719.21            Debit  North
...              ...         ...         ...      ...              ...    ...
2025            1100        C175  2023-01-20  2137.91           Credit   East
2026            2180        C072  2023-01-20  4406.49            Debit  South
2027            1965        C022  2023-01-05   676.48            Debit  North
2028            1793        C107  2023-02-02  4099.63            Debit  North
2029            1030        C049  2023-01-30   330.36           Credit  North

[2030 rows x 6 columns]

9. Identifica las transacciones con valores nulos en la columna (`Amount`) . Rellena esos valores con la mediana de los montos por tipo de transacción (`Transaction_Type`) y luego calcula el monto total de transacciones por región (`region`) .

In [137]:
# Solución
median_by_type = data.groupby('Transaction_Type')['Amount'].transform('median')
data['Amount'] = data['Amount'].fillna(median_by_type)
total_amount_by_region = data.groupby('Region')['Amount'].sum()
print("Número de clientes únicos con transacciones 'Debit' mayores a 200:", unique_customers_debit)
print("\nMonto total de transacciones por región:\n", total_amount_by_region)

Número de clientes únicos con transacciones 'Debit' mayores a 200: 200

Monto total de transacciones por región:
 Region
East     1269409.53
North    1321224.96
South    1208300.23
West     1233552.50
Name: Amount, dtype: float64

10. Busca transacciones duplicadas considerando las columnas (`Customer_ID`) y (`Date`). Elimina los duplicados manteniendo solo la primera ocurrencia. Luego, agrupa las transacciones restantes por (`Customer_ID`) y calcula el monto promedio y la cantidad de transacciones por cliente.

In [138]:
# Solución
duplicates = data.duplicated(subset=['Customer_ID', 'Date'], keep='first')
data_cleaned = data[~duplicates]

customer_stats = data_cleaned.groupby('Customer_ID').agg(
    average_amount=('Amount', 'mean'),
    transaction_count=('Amount', 'count')
).reset_index()
print("\nEstadísticas por cliente tras limpiar duplicados:\n", customer_stats)

Estadísticas por cliente tras limpiar duplicados:
     Customer_ID  average_amount  transaction_count
0          C001     3283.319412                 17
1          C002     1881.827778                  9
2          C003     3102.125000                 14
3          C004     2879.267143                  7
4          C005     3364.053333                  6
..          ...             ...                ...
195        C196     2566.555000                 10
196        C197     2530.674286                 14
197        C198     2484.925000                 12
198        C199     2942.038000                  5
199        C200     2196.990000                  5

[200 rows x 3 columns]